# Brewfile - macOS package declarations

# Modern shell
brew "bash"
brew "bash-completion@2"

# Core CLI tools
brew "bat"
brew "chezmoi"
brew "eza"
brew "fd"
brew "fzf"
brew "git"
brew "difftastic"
brew "gnupg"
brew "gawk"
brew "hugo"
brew "jq"
brew "just"
brew "lazydocker"
brew "lazygit"
brew "anomalyco/tap/opencode"
brew "ripgrep"
brew "vim"
brew "zoxide"


# Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code-nerd-font"

# Terminal
cask "kitty"

# Editors
cask "vscodium"

# GUI Apps
cask "bitwarden"
cask "brave-browser"
cask "discord"
cask "google-chrome"
cask "docker-desktop"
cask "mullvad-vpn"
cask "signal"
cask "spotify"
cask "standard-notes"
cask "telegram"
cask "thunderbird"
cask "tor-browser"
