# Brewfile - macOS package declarations

# Taps
tap "homebrew/cask-fonts"

# Modern shell
brew "bash"
brew "bash-completion@2"

# Core CLI tools
brew "bat"
brew "chezmoi"
brew "eza"
brew "fd"
brew "fzf"
brew "git"
brew "git-delta"
brew "hugo"
brew "jq"
brew "just"
brew "lazydocker"
brew "lazygit"
brew "ripgrep"
brew "starship"
brew "vim"
brew "yazi"
brew "zoxide"

# Rust
brew "rustup"

# Fonts
cask "font-jetbrains-mono-nerd-font"

# Terminal
cask "kitty"

# Editors
cask "vscodium"

# GUI Apps
cask "bitwarden"
cask "brave-browser"
cask "chromium"
cask "discord"
cask "docker"
cask "signal"
cask "spotify"
cask "standard-notes"
cask "telegram"
cask "thunderbird"
cask "tor-browser"
