bierner.markdown-mermaid
eamodio.gitlens
editorconfig.editorconfig
emmanuelbeziat.vscode-great-icons
esbenp.prettier-vscode
golang.go
ms-azuretools.vscode-docker
ms-python.python
rust-lang.rust-analyzer
tamasfe.even-better-toml
timonwong.shellcheck
usernamehw.errorlens
yzhang.markdown-all-in-one
./dracula-pro/themes/visual-studio-code/dracula-pro.vsix
